class Solution {
    public int solution(String s) {
		/* **************************************************
		 * 문제.
		 * 문자열 s를 숫자로 변환한 결과를 반환하는 함수, solution을 완성하세요.
		 * 
		 * s의 길이는 1 이상 5이하입니다.
		 * s의 맨앞에는 부호(+, -)가 올 수 있습니다.
		 * s는 부호와 숫자로만 이루어져있습니다.
		 * s는 0으로 시작하지 않습니다.
		 * str은 부호(+,-)와 숫자로만 구성되어 있고, 잘못된 값이 입력되는 경우는 없습니다.
		 *
		 *
		 * 입력 예.
		 * ===========================
		 * 1234
		 * -1234
		 * ===========================
		 *
		 * 출력 예.
		 * ===========================
		 * 1234
		 * -1234
		 * ===========================
		 * **************************************************/
    	
        return Integer.parseInt(s);
    }
}
