package year2020.month08;
public class BR_0827 {
	public static void main(String[] args) throws Exception {
		/* **************************************************
		 * 문제.
		 * 4행 3열의 배열을 선언하고 아래의 값으로 초기화 한 후 차례대로 출력한 후 배열의 모든 값을 더한 결과를 출력하는 프로그램을 작성하시오.
		 * {{3, 5, 9}, {2, 11, 5}, {8, 30, 10}, {22, 5, 1}}
		 * 
		 * 
		 * 입력 예.
		 * ===========================
		 * ===========================
		 * 
		 * 출력 예.
		 * ===========================
		 * 3 5 9
		 * 2 11 5
		 * 8 30 10
		 * 22 5 1
		 * 111
		 * ===========================
		 * **************************************************/
		
		int[][] aryList = {{3, 5, 9}, {2, 11, 5}, {8, 30, 10}, {22, 5, 1}};
		
		int sum = 0;
		for (int[] ary : aryList) {
			String line = "";
			for (int num : ary) {
				line += num + " ";
				sum+=num;
			}
			System.out.println(line.trim());
		}
		System.out.println(sum);
		
	}
}
