public class BR_1021 {
	public static void main(String[] args) {
		/* **************************************************
		 * 문제.
		 * 문자열을 "Hong Gil Dong"으로 초기화 한 후 3번부터 6번까지의 문자를 차례로 출력하시오.
		 *
		 *
		 * 입력 예.
		 * ===========================
		 * 
		 * ===========================
		 *
		 * 출력 예.
		 * ===========================
		 * g Gi
		 * ===========================
		 * **************************************************/
		String name = "Hong Gil Dong";
		System.out.println(name.substring(3, 7));
	}
}
